applications/solvers/dbs_conjugateHeatTransfer/runs/base/heatTransfer/constant/thermo.Solid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermo.Solid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


rock
{
    molWeight 100; // kg/kmol, no meaningful
    density   1000; //mass density, kg/m3
    kappa     0.15; //thermal conductivity, W/m/K
    cp        1000; //heat cpacity J/kg/K
}


// ************************************************************************* //
