applications/solvers/dbs_conjugateHeatTransfer/runs/base/heatTransfer/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    energy          sensibleEnthalpy;
    equationOfState Boussinesq;
    specie          specie;
}

mixture
{
    specie
    {
        molWeight       28.0;
    }
    equationOfState
    {
        rho0            1;
        T0              300;
        beta            0.0;
    }
    thermodynamics
    {
        Cp              1000;
        Hf              0;
    }
    transport
    {
        mu              1.5e-05;
        Pr              1;
    }

}

// ************************************************************************* //
